BOT_TOKEN = "6610138819:AAFGqNgeJNM25wE2vI2kXpmVbPpBNhV2JCs"

START_TEXT = """<b>Привет, друг</b> 👋
Я бот для подготовки к <i>ЕГЭ по информатике 2024</i> 😎
Чем могу быть полезен?"""

START_ADVICE_BUTTON = "Дай совет 💡"
START_HELP_BUTTON = "Вопрос модераторам 🆘"
START_EXERCISE_BUTTON = "Случайное задание 🎲"
START_INFO_BUTTON = "Расскажи о заданиях 📖"

START_BUTTONS = [[START_ADVICE_BUTTON, START_EXERCISE_BUTTON],
                 [START_INFO_BUTTON, START_HELP_BUTTON]]

HELP_TEXT_1 = """<b>Нужна помощь? 🆘</b>
Отправь сообщение и его увидят модераторы:
<i>Для отмены напиши /stop</i>"""
HELP_TEXT_2 = """<i>Сообщение успешно отправлено!</i> ✅"""
